SiliconLabs/simplicity_sdk/platform/Device/SiliconLabs/EFM32PG26/Include/efm32pg26_cmu.h
/* Bit fields for CMU VDAC1CLKCTRL */
#define _CMU_VDAC1CLKCTRL_RESETVALUE               0x00000001UL                                /**< Default value for CMU_VDAC1CLKCTRL          */
#define _CMU_VDAC1CLKCTRL_MASK                     0x00000007UL                                /**< Mask for CMU_VDAC1CLKCTRL                   */
#define _CMU_VDAC1CLKCTRL_CLKSEL_SHIFT             0                                           /**< Shift value for CMU_CLKSEL                  */
#define _CMU_VDAC1CLKCTRL_CLKSEL_MASK              0x7UL                                       /**< Bit mask for CMU_CLKSEL                     */
#define _CMU_VDAC1CLKCTRL_CLKSEL_DEFAULT           0x00000001UL                                /**< Mode DEFAULT for CMU_VDAC1CLKCTRL           */
#define _CMU_VDAC1CLKCTRL_CLKSEL_DISABLED          0x00000000UL                                /**< Mode DISABLED for CMU_VDAC1CLKCTRL          */
#define _CMU_VDAC1CLKCTRL_CLKSEL_EM01GRPACLK       0x00000001UL                                /**< Mode EM01GRPACLK for CMU_VDAC1CLKCTRL       */
#define _CMU_VDAC1CLKCTRL_CLKSEL_EM23GRPACLK       0x00000002UL                                /**< Mode EM23GRPACLK for CMU_VDAC1CLKCTRL       */
#define _CMU_VDAC1CLKCTRL_CLKSEL_FSRCO             0x00000003UL                                /**< Mode FSRCO for CMU_VDAC1CLKCTRL             */
#define _CMU_VDAC1CLKCTRL_CLKSEL_HFRCOEM23         0x00000004UL                                /**< Mode HFRCOEM23 for CMU_VDAC1CLKCTRL         */
#define CMU_VDAC1CLKCTRL_CLKSEL_DEFAULT            (_CMU_VDAC1CLKCTRL_CLKSEL_DEFAULT << 0)     /**< Shifted mode DEFAULT for CMU_VDAC1CLKCTRL   */
#define CMU_VDAC1CLKCTRL_CLKSEL_DISABLED           (_CMU_VDAC1CLKCTRL_CLKSEL_DISABLED << 0)    /**< Shifted mode DISABLED for CMU_VDAC1CLKCTRL  */
#define CMU_VDAC1CLKCTRL_CLKSEL_EM01GRPACLK        (_CMU_VDAC1CLKCTRL_CLKSEL_EM01GRPACLK << 0) /**< Shifted mode EM01GRPACLK for CMU_VDAC1CLKCTRL*/
#define CMU_VDAC1CLKCTRL_CLKSEL_EM23GRPACLK        (_CMU_VDAC1CLKCTRL_CLKSEL_EM23GRPACLK << 0) /**< Shifted mode EM23GRPACLK for CMU_VDAC1CLKCTRL*/
#define CMU_VDAC1CLKCTRL_CLKSEL_FSRCO              (_CMU_VDAC1CLKCTRL_CLKSEL_FSRCO << 0)       /**< Shifted mode FSRCO for CMU_VDAC1CLKCTRL     */
#define CMU_VDAC1CLKCTRL_CLKSEL_HFRCOEM23          (_CMU_VDAC1CLKCTRL_CLKSEL_HFRCOEM23 << 0)   /**< Shifted mode HFRCOEM23 for CMU_VDAC1CLKCTRL */

/** @} End of group EFM32PG26_CMU_BitFields */
/** @} End of group EFM32PG26_CMU */
/** @} End of group Parts */

#endif // EFM32PG26_CMU_H
